; domain
(define (domain Ricochet-Robots)
	(:requirements :strips :typing :action-costs :equality)

	(:types 
		robot		; Robot que se desplaza en el tablero
		casilla		; Casilla del tablero
		color		; Colores que tienen los robots, las casillas objetivo y las barreras mágicas
		orientacion
		direccion
		)

	(:constants
		slash backslash - orientacion
		left up right down stop - direccion	; Tanto la adyacencia de las casillas como el movimiento de un robot tiene una dirección
		)

	(:predicates 
		(at ?x - robot ?y - casilla) 				; Un robot está en una casilla
		(colorRobot ?x - robot ?y - color)			; Un robot tiene un color asignado
		(moviendo ?x - robot ?y - direccion)		; Un robot puede moverse, y cuando se detenga, su movimiento será stop
		(movimientoEnCurso ?x - direccion)			; Necesario para controlar que el robot que ha empezado a moverse se mueva 
		(free ?x - casilla)							; No hay robots en la casilla
		(adyacente ?x - casilla ?y - casilla ?z - direccion)	; Dos casillas son adyacentes si existe una dirección que las comunique
		(hasBarrier ?x - casilla)					; Es necesario un predicado para indicar la mera existencia de una barrera en una casilla
		(barraMagica ?x - casilla ?y - color ?z - orientacion)	; Las barreras Mágicas modifican el movimiento de los robots segun los solores y si son / (slash) o \ (backslash)
		(casillaObjetivo ?x - casilla ?y - color)	; Una casilla puede ser casillaObjetivo y debe tener un color asignado
		)

	(:functions
		(total-cost)								; Movimientos realizados, necesitamos ir contando los total-cost realizados
		)


	(:action MoverACasillaLibre	; El robot comienza su movimiento en una dirección válida
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and
			(movimientoEnCurso stop)	; Solo se puede mover un robot cuando no hay movimiento en curso
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			(moviendo ?robot ?direccion)
			(not (movimientoEnCurso stop))
			(movimientoEnCurso ?direccion)
			(increase (total-cost) 1)
			)
		)

	(:action LetItGo	; Cuando nada impide el movimiento, el robot se mueve siguiendo la dirección
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			(or 
				(not (hasBarrier ?casillaOrigen))
				(or 
					(barraMagica ?casillaOrigen ?color slash)
					(barraMagica ?casillaOrigen ?color backslash)
					)
				)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			)
		)


	(:action StopMiHada	; Cuando un robot o una pared se encuentra en el camino del robot en movimiento, este se para
		:parameters (?robot - robot
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(adyacente ?casillaOrigen ?casillaDestino ?direccion) ; Las paredes se representan como una dirección con la misma casilla origen y destino
			(not (hasBarrier ?casillaOrigen))	; Si la casilla de origen, que es en la que se termina el movimiento, tiene una barrera mágica, el movimiento no se puede terminar
			(or
				(and 		; Hay un robot
					(not (= ?casillaOrigen ?casillaDestino))
					(not (free ?casillaDestino))
					)
				(and 		; Hay una pared
					(= ?casillaOrigen ?casillaDestino)
					)
				)
			)
		:effect	(and
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso stop)
			(not (moviendo ?robot ?direccion))
			)
		)

	(:action ToLeft	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia la izquierda
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino left)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot left)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso left)
			)
		)

	(:action ToHeaven	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia arriba
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino up)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot up)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso up)
			)
		)

	(:action ToRight	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por arriba
					(= ?direccion down)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por abajo
					(= ?direccion up)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino right)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot right)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso right)
			)
		)

	(:action ToHell	; Cuando el robot se encuentra una barrera mágica que le redigirá hacia abajo
		:parameters (?robot - robot 
			?casillaOrigen - casilla
			?casillaDestino - casilla
			?direccion - direccion
			?color - color
			?colorDiferente - color
			)
		:precondition (and 
			(movimientoEnCurso ?direccion)
			(moviendo ?robot ?direccion)
			(at ?robot ?casillaOrigen)
			(colorRobot ?robot ?color)
			(not (= ?color ?colorDiferente))
			(hasBarrier ?casillaOrigen)
			(or
				(and	; El robot llega por la izquierda
					(= ?direccion right)
					(barraMagica ?casillaOrigen ?colorDiferente backslash)
					)
				(and	; El robot llega por la derecha
					(= ?direccion left)
					(barraMagica ?casillaOrigen ?colorDiferente slash)
					)
				)
			(adyacente ?casillaOrigen ?casillaDestino down)
			(not (= ?casillaOrigen ?casillaDestino))
			(free ?casillaDestino)
			)
		:effect (and
			(not (at ?robot ?casillaOrigen))
			(free ?casillaOrigen)
			(not (free ?casillaDestino))
			(at ?robot ?casillaDestino)
			; Cambiamos la direccion de avance
			(not (moviendo ?robot ?direccion))
			(moviendo ?robot down)
			(not (movimientoEnCurso ?direccion))
			(movimientoEnCurso down)
			)
		)

	)

; problem
(define (problem pRR-4)
    (:domain Ricochet-Robots)

	(:objects
		rojo - color
		robotRojo - robot
		A01 - casilla
		A02 - casilla
		A03 - casilla
		A04 - casilla
		B01 - casilla
		B02 - casilla
		B03 - casilla
		B04 - casilla
		C01 - casilla
		C02 - casilla
		C03 - casilla
		C04 - casilla
		D01 - casilla
		D02 - casilla
		D03 - casilla
		D04 - casilla
		)

	(:init
		; Bots
		(colorRobot robotRojo rojo)
		(at robotRojo B01)
		(movimientoEnCurso stop)
		(= (total-cost) 0)
		; Casillas
		(free A01)
		(free A02)
		(free A03)
		(free A04)
		(free B02)
		(free B03)
		(free B04)
		(free C01)
		(free C02)
		(free C03)
		(free C04)
		(free D01)
		(free D02)
		(free D04)
		; Casillas objetivo
		(casillaObjetivo B04 rojo)
		; Casillas Adyacentes
		(adyacente A01 A01 left)	; Pared A01 LeftFin
		(adyacente A01 A01 up)		; Pared A01 UpFin
		(adyacente A01 A02 right)
		(adyacente A01 B01 down)
		(adyacente A02 A01 left)
		(adyacente A02 A02 up)		; Pared A02 UpFin
		(adyacente A02 A03 right)
		(adyacente A02 B02 down)
		(adyacente A03 A02 left)
		(adyacente A03 A03 up)		; Pared A03 UpFin
		(adyacente A03 A04 right)
		(adyacente A03 B03 down)
		(adyacente A04 A03 left)
		(adyacente A04 A04 up)		; Pared A04 UpFin
		(adyacente A04 A04 right)	; Pared A04 RightFin
		(adyacente A04 B04 down)
		(adyacente B01 B01 left)	; Pared B01 LeftFin
		(adyacente B01 A01 up)
		(adyacente B01 B02 right)
		(adyacente B01 C01 down)
		(adyacente B02 B01 left)
		(adyacente B02 A02 up)
		(adyacente B02 B03 right)
		(adyacente B02 C02 down)
		(adyacente B03 B02 left)
		(adyacente B03 A03 up)
		(adyacente B03 B04 right)
		(adyacente B03 C03 down)
		(adyacente B04 B03 left)
		(adyacente B04 A04 up)
		(adyacente B04 B04 right)	; Pared B04 RightFin
		(adyacente B04 B04 down)	; Pared B04 - C04
		(adyacente C01 C01 left)	; Pared C01 LeftFin
		(adyacente C01 B01 up)
		(adyacente C01 C02 right)
		(adyacente C01 D01 down)
		(adyacente C02 C01 left)
		(adyacente C02 B02 up)
		(adyacente C02 C03 right)
		(adyacente C02 D02 down)
		(adyacente C03 C02 left)
		(adyacente C03 B03 up)
		(adyacente C03 C04 right)
		(adyacente C03 D03 down)
		(adyacente C04 C03 left)
		(adyacente C04 C04 up)		; Pared C04 - B04
		(adyacente C04 C04 right)	; Pared C04 RightFin
		(adyacente C04 D04 down)
		(adyacente D01 D01 left)	; Pared D01 LeftFin
		(adyacente D01 C01 up)
		(adyacente D01 D02 right)
		(adyacente D01 D01 down)	; Pared D01 DownFin
		(adyacente D02 D01 left)
		(adyacente D02 C02 up)
		(adyacente D02 D03 right)
		(adyacente D02 D02 down)	; Pared D02 DownFin
		(adyacente D03 D02 left)
		(adyacente D03 C03 up)
		(adyacente D03 D04 right)
		(adyacente D03 D03 down)	; Pared D03 DownFin
		(adyacente D04 D03 left)
		(adyacente D04 C04 up)
		(adyacente D04 D04 right)	; Pared D04 RightFin
		(adyacente D04 D04 down)	; Pared D04 DownFin
		(hasBarrier B03)
		(barraMagica B03 rojo slash)
		(barraMagica B02 rojo backslash)
		)

  (:goal (and
        (at robotRojo B04)
        (movimientoEnCurso stop)
        )
    )

    (:metric minimize (total-cost))
)

; plan
1. (moveracasillalibre robotrojo b01 b02 right)
   deleted: (at robotrojo b01) (free b02) (movimientoencurso stop)
   added: (free b01) (at robotrojo b02) (moviendo robotrojo right) (movimientoencurso right)
   goals met: 0 of 2
2. (letitgo robotrojo b02 b03 right rojo)
   deleted: (at robotrojo b02) (free b03)
   added: (free b02) (at robotrojo b03)
   goals met: 0 of 2
3. (letitgo robotrojo b03 b04 right rojo)
   deleted: (at robotrojo b03) (free b04)
   added: (free b03) (at robotrojo b04)
   goals met: 1 of 2
4. (stopmihada robotrojo b04 b04 right)
   deleted: (movimientoencurso right) (moviendo robotrojo right)
   added: (movimientoencurso stop)
   goals met: 2 of 2
